#### Milestone II
#### Michael Perrine
#### DSC 540
#### Professor Williams

# <h1><center>Market Analysis</center></h1>

The purpose of this analysis is to research market data. I will gather data from several sources. The goal is to analyze the effect of economic data on stock performance. I will also use the S&P 500 as the benchmark for my stock performance. The sources of my data will come from various sources. I will pull the stock data from FMP a stock price API. The web address for FMP is Documentation V2 - API Reference | FMP.  The economic data will come from the FRED. The FRED is managed by the St. louis Fed. The web address is Federal Reserve Economic Data | FRED | St. Louis Fed. Finally,  I will pull S&P data from Wikipedia. The web address is S&P 500 - Wikipedia.  Economic data will show a relationship between the stock data and the economy. And the S&P will show the relationship between the stock index and the market. 
	
The plan for my analysis will be to add the different data sets into one data frame. I will run an exploratory analysis on the data. I will need to transform the data and determine the variables that make the greatest impact on the analysis. It will be important for me to build graphs to determine the connection between the variables. After I build my charts, I can  run a regression analysis and test my model. For the regression analysis I will need to split my data into a training and a testing set. Along with any analysis there are challenges that I will have to manage. 

Some challenges that I can foresee are issues with combining the different data sets. Since I am working with data sets from multiple sources, I’ll have to make sure they are formatted appropriately. There may also be problems with loading the data into the program. The data will be stored in different formats, so I’ll have to ensure that they are formatted in a manner that is compatible across data sets. Another challenge that I can anticipate is overfitting the data. I need to make that the training and testing sets are not in danger of overfitting the data.

Ethical concerns are always a factor when manipulating data. It is important to implement safeguards to prevent ethical. One ethical concern is the  misrepresentation of the data. It is important that I don’t allow the data to misrepresent the results. Another ethical issue is bias. It’s important that I don’t allow my personal bias to cause me to see relationships that don’t exist.

The first series of code will load all the libraries for the analysis

In [1]:
# Load Libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from functools import reduce

The next series of code loads the data from the FRED. I will use three data sets for my analysis.
The first data set is the Coincident Economic Activity Index. This index measures the US economic condition. It takes into account non-farm payroll employment, the unemployment rate, average hours worked in manufacturing, and wages and salaries. The second data set is the Consumer Price Index. This measures the price changes of goods and services and is a leading indicator of inflation. The final data set from the FRED is the One Year T-Bill. Fluctuations in T-Bill rates indicate direction of the US Monetary Policy.

In [2]:
# This code loads in the cea data, creates a pandas dataframe, and displays the first 5 rows
cea = pd.read_csv(r"coincident economic activity index.csv")
cea = pd.DataFrame(cea)
cea.head()

  observation_date  USPHCI
0         1/1/1979   45.36
1         2/1/1979   45.51
2         3/1/1979   45.75
3         4/1/1979   45.82
4         5/1/1979   46.05

In [3]:
# This code loads in the cpi data , creates a pandas dataframe, and displays the first 5 rows
cpi = pd.read_csv(r"monthly cpi.csv")
cpi = pd.DataFrame(cpi)
cpi.head()

  observation_date  CPIAUCSL
0         1/1/1947     21.48
1         2/1/1947     21.62
2         3/1/1947     22.00
3         4/1/1947     22.00
4         5/1/1947     21.95

In [4]:
# This code loads in the t-bill data , creates a pandas dataframe,and displays the first 5 rows
t_bill = pd.read_csv(r"one year t-bill.csv")
t_bill = pd.DataFrame(t_bill)
t_bill.head()

  observation_date  TB1YR
0         7/1/1959   4.34
1         8/1/1959   4.31
2         9/1/1959   4.83
3        10/1/1959   4.69
4        11/1/1959   4.54

The next step is to combine the three data frames into one. This will give me the opportunity to do further analysis. The following series of codes will prep and combine the three data frames.

In [5]:
# The first line of code will store all three data frames into one object
dfs = (cea, cpi, t_bill)

In [6]:
# The second line of code combines all the data into one new data frame.
new_data = reduce(lambda left, right: pd.merge(left, right, on = "observation_date", how = "outer"),dfs)

In [7]:
# The third line of code renames the columns in the data frame and displays the completed data frame
new_data = new_data.set_axis(["date", "cea", "cpi" , "t_bill"], axis=1)
new_data

         date     cea      cpi  t_bill
0    1/1/1947     NaN   21.480     NaN
1    1/1/1948     NaN   23.680     NaN
2    1/1/1949     NaN   24.010     NaN
3    1/1/1950     NaN   23.510     NaN
4    1/1/1951     NaN   25.380     NaN
..        ...     ...      ...     ...
934  9/1/2020  122.45  259.997    0.13
935  9/1/2021  130.21  273.942    0.07
936  9/1/2022  136.71  296.421    3.73
937  9/1/2023  140.69  307.374    5.15
938  9/1/2024  144.20  314.851    3.87

[939 rows x 4 columns]

Now that I have one data frame I want to reverse the order of the elements. Currently they are in ascending order. I want them in descending order that way when I add my stock data I'll see everything from the most current date to the oldest date.

In [8]:
# This line of code reverses the order of the elements
new_data = new_data.iloc[::-1].reset_index(drop=True)
new_data

         date     cea      cpi  t_bill
0    9/1/2024  144.20  314.851    3.87
1    9/1/2023  140.69  307.374    5.15
2    9/1/2022  136.71  296.421    3.73
3    9/1/2021  130.21  273.942    0.07
4    9/1/2020  122.45  259.997    0.13
..        ...     ...      ...     ...
934  1/1/1951     NaN   25.380     NaN
935  1/1/1950     NaN   23.510     NaN
936  1/1/1949     NaN   24.010     NaN
937  1/1/1948     NaN   23.680     NaN
938  1/1/1947     NaN   21.480     NaN

[939 rows x 4 columns]

Now I want to view the data types in my data frame. It's important to make sure all the data types are appropriate for the elements. It looks like I need to change the date data type. It's listed as an object and should be listed as date/time.

In [9]:
# This code displays the data type
new_data.dtypes

date       object
cea       float64
cpi       float64
t_bill    float64
dtype: object

In [11]:
new_data.head()

       date     cea      cpi  t_bill
0  9/1/2024  144.20  314.851    3.87
1  9/1/2023  140.69  307.374    5.15
2  9/1/2022  136.71  296.421    3.73
3  9/1/2021  130.21  273.942    0.07
4  9/1/2020  122.45  259.997    0.13

In [12]:
# This code changes the date data type from object to date/time and displays the result
new_data["date"] = pd.to_datetime(new_data["date"],format='mixed')
new_data.dtypes

date      datetime64[ns]
cea              float64
cpi              float64
t_bill           float64
dtype: object

In [ ]:
# This code displays the new date format
new_data.head()

        date     cea      cpi  t_bill
0 2024-09-01  144.20  314.851    3.87
1 2023-09-01  140.69  307.374    5.15
2 2022-09-01  136.71  296.421    3.73
3 2021-09-01  130.21  273.942    0.07
4 2020-09-01  122.45  259.997    0.13

In [ ]:
# This code drops NaN values. I chose to drop the 
new_data_1 = new_data.dropna(how="any")
new_data_1

          date     cea      cpi  t_bill
0   2024-09-01  144.20  314.851    3.87
1   2023-09-01  140.69  307.374    5.15
2   2022-09-01  136.71  296.421    3.73
3   2021-09-01  130.21  273.942    0.07
4   2020-09-01  122.45  259.997    0.13
..         ...     ...      ...     ...
902 1983-01-01   47.12   97.900    8.01
903 1982-01-01   47.54   94.400   12.77
904 1981-01-01   47.16   87.200   12.62
905 1980-01-01   46.74   78.000   10.96
906 1979-01-01   45.36   68.500    9.54

[475 rows x 4 columns]